---
type: RebarCurvesData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 10
tags: [revit-api, class]
---

# RebarCurvesData

`Autodesk.Revit.DB.Structure.RebarCurvesData` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddBarGeometry | — | `` |
| Method | CanAddBarGeometry | 2018 | `public bool CanAddBarGeometry ()` |
| Method | ClearAllAddedBarGeometry | 2018 | `public void ClearAllAddedBarGeometry ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAddedBarGeometry | 2018 | `public IList < Curve > GetAddedBarGeometry ( int barIndex )` |
| Method | GetDistributionPath | 2018 | `public IList < Curve > GetDistributionPath ()` |
| Method | GetNumberOfBarGeometry | 2018 | `public int GetNumberOfBarGeometry ()` |
| Method | GetRebarUpdateCurvesData | 2018 | `public RebarUpdateCurvesData GetRebarUpdateCurvesData ()` |
| Method | SetDistributionPath | 2018 | `public void SetDistributionPath ( IList < Curve > path )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |